modules/backend-postal-api-rest/src/main/resources/UpdateCus.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" 
			   xmlns:tem="http://tempuri.org/">
   <soap:Header/>
   <soap:Body>
      <tem:UpdateCus>
         <!--Optional:-->
         <tem:XMLCusData>
         </tem:XMLCusData>
         <!--Optional:-->
         <tem:username>vpboxdwservice</tem:username>
         <!--Optional:-->
         <tem:pass>vpbxd#123aA@</tem:pass>
         <tem:convert>0</tem:convert>
      </tem:UpdateCus>
   </soap:Body>
</soap:Envelope>